оперативныйучет2/src/Documents/оуп_ПакетДокументовПередачиПереработчику/оуп_ПакетДокументовПередачиПереработчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>оуп_ПакетДокументовПередачиПереработчику</name>
  <attributes>
    <name>ОрганизацияОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Переработчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПереработки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерДавалец</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоступления</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

оперативныйучет2/src/Documents/оуп_ПакетДокументовПередачиПереработчику/ObjectModule.bsl
#Область ОбработчикиСобытий
//@skip-check module-accessibility-at-client
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	попытка
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
			
		СткПараметрыДокументаПереработки = 
			оуп_ПередачаВПереработкуВызовСервера.ЗаполнитьСтруктуруПараметровДокументПереработки(ЭтотОбъект);
		ДокументПередачи = оуп_ПередачаВПереработкуВызовСервера.СформироватьДокументПередачи(СткПараметрыДокументаПереработки, ЭтотОбъект);
		
		ПровестиДокументИДобавитьСсылкуВТЧ(ДокументПередачи);
		
		СткПараметрыДокументаПоступления = оуп_ПередачаВПереработкуВызовСервера.ЗаполнитьСтруктуруПараметровДокументПоступления(ЭтотОбъект);		
		ДокументПоступления = оуп_ПередачаВПереработкуВызовСервера.СформироватьДокументПоступления(СткПараметрыДокументаПоступления, товары);

		ПровестиДокументИДобавитьСсылкуВТЧ(ДокументПоступления);	
		
		Записать();
	
		если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ВызватьИсключение "Транзакция не активна";
		 КонецЕсли;
	Исключение
		если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		СтрокаОшибкиЖурнал = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		СтрокаОшибкиКлиент = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ПакетДокументовПередачиВПереработку.Проведение", УровеньЖурналаРегистрации.Ошибка,,, СтрокаОшибкиЖурнал);
		Отказ= истина;
		ВызватьИсключение СтрокаОшибкиКлиент;
	КонецПопытки;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//@skip-check module-accessibility-at-client
Процедура ПровестиДокументИДобавитьСсылкуВТЧ(Документ)
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	строка = документы.Добавить();
	Строка.Документ = Документ.Ссылка;
КонецПроцедуры
#КонецОбласти
